reference/reference_script.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Reference - Script</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 12:57:18 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet reference documentation for pushing over SSH"/>
<meta name="keywords" content="pallet ssh push keys identity"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet Reference - Script</h1>

<p>Pallet scripts are written using an embedding of shell script in <a href="http://clojure.org">Clojure</a>, and
allows for abstraction of operating system variations.
</p>
<p>
At it's simplest, the <code>script</code> macro takes one or more forms and converts them
to shell script.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span>
  '[pallet.stevedore <span style="color: #0000ff;">:as</span> stevedore])

(stevedore/script
  (ls))
</pre>





<pre class="example">
ls
</pre>



<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Variables </h2>
<div class="outline-text-2" id="text-1">

<p>There is an obvious mismatch between Clojure's immutable data approach, and
shell script's mutable variables.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">Substitution </h3>
<div class="outline-text-3" id="text-1_1">

<p>For accessing the value of a script variable, stevedore uses `deref` or `@`, which
are also used for command substitution.
</p>



<pre class="src src-clojure">(stevedore/script
 (<span style="color: #0000ff;">deref</span> TMPDIR))
</pre>





<pre class="example">
${TMPDIR}
</pre>


<p>
If the variable isn't set, a default can be supplied.
</p>


<pre class="src src-clojure">(stevedore/script
 @TMPDIR-/tmp)
</pre>





<pre class="example">
${TMPDIR-/tmp}
</pre>


</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">Assignment </h3>
<div class="outline-text-3" id="text-1_2">

<p>Values can be defined with `set!`.
</p>


<pre class="src src-clojure">(stevedore/script
 (set! x 1))
</pre>





<pre class="example">
x=1
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Command Substitution </h2>
<div class="outline-text-2" id="text-2">


<p>
Similar to variable substitution, command substitution uses `deref`.
</p>



<pre class="src src-clojure">(stevedore/script
 (set! R @(cat <span style="color: #f4a460;">"/etc/redhat-release"</span>)))
</pre>





<pre class="example">
R=$(cat /etc/redhat-release)
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Loops </h2>
<div class="outline-text-2" id="text-3">

<p>Shell script `for` loops are mapped to clojure`s `doseq`.
</p>



<pre class="src src-clojure">(stevedore/script
 (<span style="color: #4682b4;">doseq</span> [x [<span style="color: #f4a460;">"a"</span> <span style="color: #f4a460;">"b"</span> <span style="color: #f4a460;">"c"</span>]]
   (<span style="color: #0000ff;">println</span> @x)))
</pre>





<pre class="example">
for x in a b c; do
echo ${x}
done
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Functions </h2>
<div class="outline-text-2" id="text-4">


<p>
Calling a function follows clojure's normal syntax.
</p>



<pre class="src src-clojure">(stevedore/script
 (foo x y))
</pre>





<pre class="example">
foo x y
</pre>


<p>
Defining a function follows a simplified version of clojure's `defn`, and does
not allow for destructuring. Arguments are named and automatically mapped to the
shell function's numbered arguments.
</p>



<pre class="src src-clojure">(stevedore/script
 (script (<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">foo</span> [x y] (bar x))))
</pre>





<pre class="example">
script function foo() {
x=$1
y=$2
bar x
 }
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Arrays </h2>
<div class="outline-text-2" id="text-5">


<p>
Array literals are generated from clojure's `vector` notation.
</p>



<pre class="src src-clojure">(stevedore/script
 [1 <span style="color: #f4a460;">"2"</span> (quoted 3) <span style="color: #0000ff;">:four</span>])
</pre>





<pre class="example">
(1 2 "3" four)
</pre>


<p>
Array access uses `aget` and `aset`.
</p>



<pre class="src src-clojure">(stevedore/script
 (<span style="color: #0000ff;">aget</span> foo 1))
</pre>





<pre class="example">
${foo[1]}
</pre>





<pre class="src src-clojure">(stevedore/script
 (<span style="color: #0000ff;">aset</span> foo 1 <span style="color: #0000ff;">:foo</span>))
</pre>





<pre class="example">
foo[1]=foo
</pre>



</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Unquoting </h2>
<div class="outline-text-2" id="text-6">


<p>
One advantage of embedding script in clojure is that we can escape back to
clojure to substitute in values.
</p>



<pre class="src src-clojure">(<span style="color: #4682b4;">let</span> [tmp <span style="color: #f4a460;">"/tmp"</span>]
  (stevedore/script
    (ls ~tmp)))
</pre>





<pre class="example">
ls /tmp
</pre>



</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1">Expressions </h3>
<div class="outline-text-3" id="text-6_1">

<p>We can also unquote arbitrary clojure expressions.
</p>


<pre class="src src-clojure">(stevedore/script
 (ls ~(<span style="color: #0000ff;">str</span> <span style="color: #f4a460;">"/"</span> <span style="color: #f4a460;">"tmp"</span>)))
</pre>





<pre class="example">
ls /tmp
</pre>


</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2">Splicing </h3>
<div class="outline-text-3" id="text-6_2">

<p>Sometimes we want to add the contents of a collection into a script, without
demarking the boundaries of the collection.
</p>


<pre class="src src-clojure">(<span style="color: #4682b4;">let</span> [files [<span style="color: #f4a460;">"a"</span> <span style="color: #f4a460;">"b"</span> <span style="color: #f4a460;">"c"</span>]]
  (stevedore/script
    (ls ~@files)))
</pre>





<pre class="example">
ls a b c
</pre>



</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Script functions </h2>
<div class="outline-text-2" id="text-7">


<p>
Script functions are defined with `pallet.script/defscript` and provide multimethods
for shell script generation.  In pallet this is used to abstract away script
differences between operating systems.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span>
  '[pallet.stevedore <span style="color: #0000ff;">:as</span> stevedore]
  '[pallet.script <span style="color: #0000ff;">:as</span> script])

(script/defscript ls [&amp; args])
(stevedore/defimpl ls <span style="color: #0000ff;">:default</span> [&amp; args]
  (ls ~@args))
(stevedore/defimpl ls [<span style="color: #0000ff;">:windows</span>] [&amp; args]
  (dir ~@args))

(script/with-template [<span style="color: #0000ff;">:windows</span>]
  (stevedore/script
    (ls a b c)))
</pre>




<pre class="example">
dir a b c
</pre>



</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Scripting Guide </h2>
<div class="outline-text-2" id="text-8">


<p>
An excellent reference on shell scripting is available at <a href="http://tldp.org/LDP/abs/html/">http://tldp.org/LDP/abs/html/</a>.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-21 12:57:18 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
